public class ShuttlesNew {
    public static void main(String[] args) {
        int x = 1;

        //Це - соті, тобто перша цифра в трьозначному числі
        for (int i = 0; i < 10; i++) {
            //Це - десяті, тобто друга цифра в трьозначному числі
            for (int j = 0; j < 10; j++) {
                //Це - одиниці, тобто третя цифра в трьозначному числі
                for (int k = 0; k < 10; k++) {
                    //Робимо перевірку - щоб пропустити випадок, коли у нас число 000
                    if (i == 0 && j == 0 && k == 0) {
                        continue;
                    }
                    //Перевіряємо лічильник шатлів передд початком роботи з цифрами
                    if (x > 100) {
                        break;
                    }
                    //Умова - щоб не пропускати небажані числа ні в якості сотих, ні в якості десятих, ні в якості одиниць
                    if (i != 4 && i != 9 && j != 4 && j != 9 && k != 4 && k != 9) {
                        //Якщо все ок - друкуємо
                        System.out.println("Shuttle " + x + " with number " + i + j + k);
                        //Збільшуємо лічильник
                        x++;
                    }
                }
            }
        }
    }
}